name: "tts"
backend: "python"


input [
  {
    name: "TEXTS"
    data_type: TYPE_STRING
    dims: [1]
  }
]

output [
  {
    name: "OUTPUT"
    data_type: TYPE_STRING
    dims: [1]
  }
]


instance_group [
    {
        count: 1
        kind: KIND_GPU
    }
]