name: "kazllm"
backend: "python"
max_batch_size: 0


input [
    {
        name: "TEXTS"
        data_type: TYPE_STRING
        dims: [ -1 ]
    }
]

output [
    {
        name: "OUTPUT"
        data_type: TYPE_STRING
        dims: [ -1 ]
    }
]


instance_group [
    {
        count: 1
        kind: KIND_CPU
    }
]

version_policy: { latest: { num_versions: 1}}