name: "kazllm"
backend: "python"
max_batch_size: 0

model_transaction_policy {
  decoupled: True
}

input [
    {
        name: "texts"
        data_type: TYPE_STRING
        dims: [ -1 ]
    },
    {
        name: "task"
        data_type: TYPE_STRING
        dims: [ -1 ]
    },
    {
        name: "question"
        data_type: TYPE_STRING
        dims: [ -1 ]
    }
]

output [
    {
        name: "output"
        data_type: TYPE_STRING
        dims: [ -1 ]
    }
]


instance_group [
    {
        count: 1
        kind: KIND_GPU
        gpus: [ 0 ]
    }
]

version_policy: { latest: { num_versions: 1}}