name: "stt"
platform: "python"
input [
  {
    name: "AUDIO"
    data_type: TYPE_FP32
    dims: [-1]
  }
]
output [
  {
    name: "TRANSCRIPTION"
    data_type: TYPE_STRING
    dims: [1]
  }
]
instance_group [
    {
        count: 1
        kind: KIND_CPU
    }
]